Repository: 84000/data-translation-memory
Catalog: toh349-v4.tmx
Source language: bo
Languages: en

source: །རྨི་ལམ་བསྟན་པ་འདི་ལྟ་བུ་དེ་ཐོས་པ་དང་། བློན་པོ་ཆེན་པོ་བློ་གྲོས་ཆེན་པོ་སྡུག་བསྔལ་དྲག་པོས་གདུངས་ཤིང་མིག་མཆི་མས་གང་བ་དང་། ལག་པ་འགྲམ་པ་ལ་གཏད་དེ་སེམས་ཁོང་དུ་ཆུད་པས་གནས་ནས་རྒྱལ་པོ་དཔལ་གྱི་སྡེ་བྱམས་པ་དང་སྙིང་རྗེའི་བདག་ཉིད་ཅན་སེམས་ཅན་ཐམས་ཅད་ལ་མཉེས་གཤིན་པ་ཡོན་ཏན་དུ་མ་དང་ལྡན་པ་ལ་མི་རྟག་པའི་སྟོབས་ཉེ་བར་གནས་པ་ནི་ཧ་ཅང་མྱུར་ཆེས་སོ།
en: When he heard the significance of the dream, the great minister Mahāmati was struck by deep sorrow. His eyes filled with tears, he rested his hand on his cheek, and he sat depressed, pondering how the force of impermanence had arrived too soon for the loving and compassionate King Śrīsena, he who had been so affectionate toward all sentient beings and possessed so many great qualities.

source: །དེ་ནས་ནུབ་གསུམ་པ་ལ་བློན་པོ་སྟོང་ཕྲག་བཅུ་གཉིས་རྨི་ལམ་ལྔ་རྨིས་ཏེ། ཁྲི་ཡིས་རྒྱལ་པོ་དཔལ་གྱི་སྡེའི་གདུགས་དང་ཅོད་པན་ཕྲོགས་ཏེ་སླར་ཡང་བྱིན་པ་དང་སྐྱེ་བོ་ཐམས་ཅད་ཀྱི་མགོ་བཅད་ནས་སླར་ཡང་བྱུང་བ་དང་། འཛམ་བུའི་གླིང་གི་མི་ཐམས་ཅད་ཀྱི་མིག་ཕྱུང་ནས་སླར་ཡང་སྐྱེས་པ་དང་། འཛམ་བུའི་གླིང་གི་མི་ཐམས་ཅད་ཀྱི་རྐང་པ་དང་ལག་པ་རྣམས་བཅད་ནས་སླར་ཡང་སྐྱེས་པ་དང་རྒྱལ་པོ་དཔལ་གྱི་སྡེ་སེང་གེའི་ཁྲི་ལས་བབ་ནས་སླར་ཡང་འཛེག་པར་རྩོམ་པར་རྨིས་པ་དང་།
en: “Then, on the third night, twelve thousand ministers dreamt five dreams. They dreamt that ten thousand beings robbed King Śrīsena of his parasol and crown, but they were then handed back to him; that everyone’s heads were chopped off, but then restored; that the eyes of every human in Jambudvīpa were gouged out, but then restored; that the hands and feet of every human in Jambudvīpa were chopped off, but then restored; and that King Śrīsena attempted to ascend the lion throne again after he had descended from it.

source: འཇིགས་ཤིང་སྐྲག་ལ་ཡི་མུག་ནས་རྒྱལ་པོ་དཔལ་གྱི་སྡེ་ས་ཆེན་པོ་སྐྱོང་བ་མཛད་པ། བྱམས་པའི་བདག་ཉིད་ཅན་སྙིང་རྗེ་ཆེ་བ། སེམས་ཅན་ཐམས་ཅད་ལ་མཉེས་གཤིན་པ་ལ་མི་རྟག་པའི་སྟོབས་ཉེ་བར་གནས་པར་མི་འགྱུར་གྲང་།
en: The terrified, distressed, and despairing ministers thought, ‘Will the force of impermanence come for King Śrīsena? Will it be the end of this protector of a vast land, he who is so loving and compassionate, he who brings joy and rouses affection in all sentient beings?

source: བདག་ཅག་རྣམས་ལྷ་དང་ལྷན་ཅིག་གནས་པ་ལས་ཐ་དད་པར་གྱུར་པ་དང་། སོ་སོ་བ་དང་བྲལ་བ་དང་བྱེ་བྲལ་མི་འགྱུར་གྲང་།
en: Will we live without the king? Will we be separated? Will we be parted? Will we be alone?

source: འཛམ་བུའི་གླིང་པའི་སྐྱབས་དང་དཔུང་གཉེན་མེད་པར་མི་འགྱུར་གྲང་།
en: Will Jambudvīpa lose its protector and defender?’

source: དེ་རྣམས་ཀྱིས་མཚན་མཁན་རྣམས་བོས་ནས་སྨྲས་པ་དང་། དེ་རྣམས་ཀྱིས་ཇི་ཙམ་ན་ཐམས་ཅད་འདི་བཞིན་དུ་འགྱུར་ཞེས་ལུང་བསྟན་ཏོ།
en: “The ministers then called for soothsayers to ask about the dreams’ significance.

source: །འདི་ལྟ་བུའི་རྨི་ལམ་བསྟན་པ་ཐོས་པ་དང་། གྲོང་ཁྱེར་ཨ་རིཥྛ་ན་གནས་པའི་སྐྱེ་བོའི་ཚོགས་རྣམས་ཉམ་ཐག་པའི་ང་རོས་ངུ་བར་བརྩམས་སོ།
en: After a while, the soothsayers foretold that things would be just as they had dreamt. “After hearing about the dreams, the populace of Ariṣṭa city was wretched and started to weep aloud.

source: །ཐོས་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པས་འཛམ་བུའི་གླིང་པའི་མི་ཐམས་ཅད་མྱ་ངན་དྲག་པོའི་སྡུག་བསྔལ་གྱིས་བཅོམ་ནས་ཤིན་ཏུ་སྨྲེ་སྔགས་འདོན་པར་གྱུར་ཏོ།
en: Word spread from person to person, and soon everyone in Jambudvīpa wailed because of their suffering and intense grief.

source: །དེ་ལྟར་གྱུར་པ་དེ་རྒྱལ་པོ་དཔལ་གྱི་སྡེས་ཐོས་སོ། །ཐོས་ནས་ཀྱང་ཡང་བསམས་པ། ངའི་ལུས་སློང་བ་འོང་བར་འགྱུར་རོ་སྙམ་ནས་སེམས་རབ་ཏུ་དགའ་བ་དང་། མགུ་བར་གྱུར་ཏོ།
en: King Śrīsena heard of this and thought, ‘How pleasing and delightful that someone would ask for my body!’ Thus, he made an announcement:

source: །ཤེས་ལྡན་དག་འཛམ་བུའི་གླིང་གི་མི་ཁྱེད་རྣམས་བདེ་བ་དང་ཕེབས་པས་དགེ་བ་ལ་གཞོལ་བར་གྱིས་ཤིག །ཁྱེད་རྣམས་སྒྱུ་མ་ལྟ་བུའི་རྨི་ལམ་ལ་སེམས་པས་ཅི་ཞིག་བྱ་ཞེས་འཛམ་བུའི་གླིང་པ་ཐམས་ཅད་དུ་དྲིལ་བསྒྲགས་སོ། །དེ་ནས་རྒྱལ་པོ་དཔལ་གྱི་སྡེས་དྲིལ་བསྒྲགས་པ་དེ་ཐོས་པ་དང་། འཛམ་བུའི་གླིང་པའི་མི་ཐམས་ཅད་དབུགས་ཕྱིན་པར་གྱུར་ཏོ།
en: ‘Wise ones, people of Jambudvīpa, engage in virtue with joy and calmness. What is the point of thinking about illusion-like dreams?’ When the people of the world heard King Śrīsena’s announcement, they were relieved.

source: །ཡང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོའི་ཕོ་བྲང་ཨ་རིཥྛའི་བྱང་ཕྱོགས་རྒྱང་གྲགས་ཙམ་གྱིས་ཕྱོགས་ན་རི་བོ་ཞིག་ཡོད་དེ། དེ་ན་དྲང་སྲོང་ལྔ་བརྒྱ་ཙམ་གནས་སོ།
en: “In those days, five hundred sages lived on a mountain about two miles north of the royal estate of Ariṣṭa.

source: །ཇི་ཙམ་ན་དུས་གཞན་ཞིག་གི་ཚེ་དེ་རྣམས་ཀྱི་དོན་དུ་འཇུག་པ་དྲང་སྲོང་གཅིག་དོན་གྱི་བྱ་བ་འགའ་ཞིག་གི་ཕྱིར་རྒྱལ་པོའི་ཕོ་བྲང་ཨ་རིཥྛར་འོངས་སོ།
en: A short time after the dreams, one of the sages came to the king’s estate to do the sages’ bidding.

source: །ཡང་དུས་དེའི་ཚེ་རྒྱལ་པོ་དཔལ་གྱི་སྡེ་ལྷ་མོ་རྒྱལ་བའི་འོད་དང་ལྷན་ཅིག་ཏུ་ནང་དུ་ཞུགས་ནས་སྐྱེད་མོས་ཚལ་གྱི་སར་སོང་ངོ་།
en: At that time, King Śrīsena and Queen Jayaprabhā were strolling in the garden.

source: །དྲང་སྲོང་དེས་རྒྱལ་བ་དང་ཚེ་རིང་བའི་བརྗོད་པ་བྱས་པ་དང་། དྲང་སྲོང་དེས་ལྷ་མོ་རྒྱལ་བའི་འོད་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་མཐོང་སྟེ།
en: The sage exclaimed, ‘May the king be victorious and live for a long time!’ The sage also saw Queen Jayaprabhā adorned with ornaments.

source: འདི་ལྟར་ཡང་དེའི་སྐྱེ་བ་སྔ་མའི་ཆུང་མར་གྱུར་པ་ཡང་ཡིན་པས་སྔོན་གྱི་ཆགས་པ་དང་འབྲེལ་པའི་དབང་གིས་ཚུལ་བཞིན་མ་ཡིན་པའི་ཡིད་ལ་བྱེད་པ་སྐྱེས་པར་གྱུར་ཏེ།
en: In a past life the queen had been his wife. The influence of this previous desire and their previous relationship caused him to have inappropriate thoughts.

source: དེ་ཡིད་ལ་སེམས་ཤིང་ལམ་དེ་ནས་སོང་སྟེ། ལམ་དེ་ནས་འདས་པ་དང་ཇི་ཙམ་ན་དྲང་སྲོང་དེ་རྒྱལ་པོའི་ཕོ་བྲང་གྲོང་ཁྱེར་ཨ་རིཥྛར་བྱ་བའམ། བྱེད་པ་ཐམས་ཅད་བྱས་ཏེ་ཡོངས་སུ་རྫོགས་པ་དང་བསྟི་གནས་སུ་སོང་ངོ་།
en: Thinking these inappropriate thoughts, he walked along the path, completed his chores in Ariṣṭa city, and went back to his dwelling.

source: །ཇི་ཙམ་ན་དུས་གཞན་ཞིག་གི་ཚེ་དྲང་སྲོང་དེས་བྲམ་ཟེའི་ཁྱེའུ་གཅིག་རིག་བྱེད་འདོན་པ་ཡོངས་སུ་རྫོགས་པ་དང་། དེས་མཁན་པོའི་རྐང་པ་ལ་གཏུགས་ནས་སྨྲས་པ། མཁན་པོ་ལ་ནོར་ཇི་ལྟ་བུ་དབུལ་བར་བགྱི། མཁན་པོས་བཀའ་སྩོལ་ཅིག །
en: “A little while later, on another occasion, a student of this same sage, a brahmin boy, completed his recitation of the Vedas, touched his preceptor’s feet, and asked in gratitude, ‘Preceptor, what wealth can I offer you?’

source: དྲང་སྲོང་གིས་སྨྲས་པ། དེ་བས་ན་བུ་རྒྱལ་པོ་དཔལ་གྱི་སྡེའི་བཙུན་མོའི་མཆོག་བཙུན་མོ་རྒྱལ་བའི་འོད་སློངས་ལ་ངའི་བསྙེན་བཀུར་བྱ་བ་དང་། མཁན་པོ་ལ་མཁན་པོའི་ནོར་དང་། བླ་མ་ལ་མཆོད་པར་བྱ་བའི་ཕྱིར་བྱིན་ཅིག །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། བྲམ་ཟེའི་ཁྱེའུ་དེ་གནད་དུ་བསྣུན་པའི་རི་དགས་བཞིན་དུ་སྡུག་བསྔལ་དྲག་པོས་གདུངས་ཏེ་མཆོག་ཏུ་ཡི་མུག་པ་དང་། བསམས་པ་གནས་འདི་ནི་འབྱུང་བར་དཀའ་བ་དང་རྙེད་པར་དཀའ་ན།
en: “The sage replied, ‘Son, if you wish, go ask for King Śrīsena’s supreme queen, Jayaprabhā. Give her to me as your offering, a gift for your preceptor, an homage to your guru.’ “When this was said, the brahmin boy was overwhelmed by great sorrow and acute despair; he was like a deer whose vital organ has been pierced. He thought, ‘This situation will only come about with difficulty, and it will be no easy task to acquire her.

source: ཇི་ལྟར་ཡང་བྲམ་ཟེ་ཉོན་མོངས་པ་དག་ལྟ་བུས་རྒྱལ་པོ་ལ་བཙུན་མོ་རྒྱལ་བའི་འོད་འདི་བྱིན་ཅིག །ཅེས་ཇི་ལྟར་སྨྲ་བར་ནུས།
en: How could a troubled brahmin like me ask the king to give him Queen Jayaprabhā?

source: འདི་ལྟར་བསླང་བར་བྱ་བ་མ་ཡིན་པའི་དངོས་པོ་འདི་ལ་ཀུན་དུ་སྦྱོར་བ་གང་ཡིན་པ་དེས་ན།
en: Why am I being asked to get something that is unattainable?

source: མཁན་པོ་ངེས་པར་བདག་ལ་དམོད་པ་བྱེད་པར་འདོད་པ་ཡིན་ནོ།
en: The preceptor clearly wants to place a curse on me.’

source: །དེ་ནས་དྲང་སྲོང་དེས་དེའི་བཞིན་རྣམ་པར་འགྱུར་བས་ནང་གི་བསམ་པ་རྟོགས་ནས་སྨྲས་པ།
en: “The change in the boy’s facial expression allowed the sage to realize his thoughts, and the sage said, ‘Son, do not be afraid.

source: བུ་མ་འཇིགས་ཤིག་ཇི་ལྟར་ན་སེམས་འདི་ལྟར་ཁོང་དུ་ཆུད།
en: Why are you so depressed?

source: རྒྱལ་པོ་འདི་ནི་བདག་ཉིད་ཆེ་བ།
en: The king is a great being.

source: ཐམས་ཅད་སྟེར་བ།
en: He gives away everything.

source: ཐམས་ཅད་ཡོངས་སུ་གཏོང་ཞིང་ཆགས་པ་མེད་པར་ཡོངས་སུ་གཏོང་བས་ཐ་ན་རང་གི་ཤ་ཡང་གཏོང་སྟེ།
en: He lets go of everything. He lets go of everything completely and without attachment. He would even give away his own flesh.

source: །བུ་དེས་ན་རྒྱལ་པོས་བཙུན་མོའི་མཆོག་སྟེར་བར་འགྱུར་གྱིས་ཡི་མུག་པར་མ་བྱེད་ཅིག །
en: Therefore, son, do not despair; the king will give you his supreme queen.’

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ། གལ་ཏེ་མ་སོང་ན་ནི་གང་དམོད་པ་བྱེད་པའི་གནས་དེ་ཡོད་པས་འགྲོ་སྙམ་ནས་དེ་དམོད་པས་འཇིགས་པས་སྨྲས་པ། མཁན་པོ་གལ་ཏེ་དེ་ལྟ་ན་མཆིའོ་ཞེས་དེས་དེའི་རྐང་པ་ལ་གཏུགས་ནས་སོང་སྟེ། རྒྱལ་པོའི་ཕོ་བྲང་ཨ་རིཥྛར་ཕྱིན་ཏོ།
en: “Then the boy thought, ‘If I do not go, I will be cursed.’ And out of fear of this curse, he said to the sage, ‘Preceptor, if that is so, I will go.’ After touching the sage’s feet, he traveled to the king’s estate, Ariṣṭa.

source: །དེ་བཞིན་དུ་ཤིང་ཤུན་གྱི་གོས་གྱོན་ཞིང་དབྱིག་པ་དང་། རིལ་བ་ལག་ན་ཐོགས་ལ་ས་རྡུལ་གྱིས་ལུས་ལ་གོས་པ་དང་། རྒྱལ་པོ་དཔལ་གྱི་སྡེ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་རྒྱལ་པོ་དཔལ་གྱི་སྡེ་ལ་རྒྱལ་བ་དང་། ཚེ་སྤེལ་བ་བྱས་ནས་བསམས་པ།
en: “Having applied dust to his body, wearing tree-bark cloth, and holding a staff and a little vase in his hands, the boy went to the site where King Śrīsena was and exclaimed, ‘May the king be victorious and may his life be long!’ Then he thought, ‘Should I ask?

source: ཅི་བསླང་ངམ་འོན་ཏེ་མི་བསླང་སྟེར་བར་འགྱུར་རམ་མི་སྟེར་བར་འགྱུར།
en: Or will he give her to me without my having to ask? Or will he not give her to me?

source: ངའི་ཡིད་ལ་རེ་བ་འབྲས་བུ་དང་བཅས་པར་འགྱུར་རམ། འབྲས་བུ་མེད་པར་འགྱུར་སྙམ་ནས་བདག་ཉིད་སྨོད་བཞིན་དུ་རྒྱལ་པོའི་མདུན་ན་དམན་པའི་བཞིན་གྱིས་ཅང་མི་སྨྲ་བར་འདུག་གོ།
en: Will my wishes be fulfilled or not?’ And he stood in front of the king with an unsettled look on his face, castigating himself, not speaking.

source: །དེ་ནས་རྒྱལ་པོ་དཔལ་གྱི་སྡེས་བསམས་པ། འདི་ནི་ང་ལ་སློང་དུ་འོངས་སོ་སྙམ་ནས་བྲམ་ཟེའི་ཁྱེའུ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བྲམ་ཟེ་ཁྱོད་ཀྱི་དགོས་པ་གང་ཡིན་པ་དེ་སྨྲོས།
en: “Thinking that the brahmin boy had come to beg something from him, King Śrīsena asked him, ‘Brahmin, what is it that you want?

source: དེ་རིང་ཁྱོད་ཀྱི་ཡིད་ལ་རེ་བ་ཡོངས་སུ་རྫོགས་པར་བྱའོ།
en: Today, I will fulfill your wishes completely.’

source: །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། བྲམ་ཟེའི་ཁྱེའུ་དེ་མི་འཇིགས་པ་སྐྱེས་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལ་སྨྲས་པ།
en: When the king said this, the brahmin boy gained confidence and replied to the bodhisattva, ‘This is good.

source: དེ་ལེགས་ཀྱིས་ལྷ་རི་ག་གེ་མོ་ན་བདག་གི་མཁན་པོ་དྲང་སྲོང་འདོན་དུ་འཇུག་པ་འཁོར་ལྔ་བརྒྱ་དང་གནས་ཏེ་དེ་ལས་བདག་གིས་རིག་བྱེད་འདོན་པ་ཡོངས་སུ་རྫོགས་པས་རྒྱལ་པོ་ཆེན་པོ་ད་ཐུགས་བརྩེ་བས་བཙུན་མོ་རྒྱལ་བའི་འོད་བདག་ལ་སྩོལ་ཅིག །མཁན་པོ་ལ་མཁན་པོའི་ནོར་དང་། བླ་མ་མཆོད་པའི་ཕྱིར་བདག་གིས་མཁན་པོ་ལ་དབུལ་བར་བགྱིའོ།
en: Lord, on a certain mountain my preceptor lives with his companions; they are five hundred sages who recite the Vedas. I have completed my Vedic studies with him. Great King, through your compassion give me Queen Jayaprabhā, and I will offer her to my preceptor as a gift, an homage to my guru.’

source: །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། རྒྱལ་པོ་དཔལ་གྱི་སྡེ་བརྩེ་བའི་དབང་གིས་ཡིད་མི་དགའ་བར་གྱུར་ཏེ།
en: “When these words were spoken, King Śrīsena was distraught. He loved the queen.

source: བཙུན་མོ་རྒྱལ་བའི་འོད་འདི་ང་དང་བྲལ་ན་ཇི་ལྟར་སྲོག་འཛིན་པར་ནུས། འཁོར་དེ་དག་ཐམས་ཅད་ཀྱང་རྒྱ་མཚོ་ཟབ་མོའི་སྒྲ་མི་གཡོ་བ་དང་།
en: ‘If Queen Jayaprabhā were separated from me,’ he thought, ‘will we survive?’ For a while, all the members of the king’s and queen’s retinues were as quiet as the oceans’ depths.

source: གནད་དུ་བསྣུན་པ་བཞིན་དུ་སྡུག་བསྔལ་དྲག་པོས་གདུངས་པས་རྟབས་བག་ཏུ་འདི་ཅི་འདི་ཅི་ཞེས་སྐྱོ་བས་རབ་ཏུ་གདུངས་སོ།
en: Then it was as if a great pain were piercing their vital organs. ‘What is this?’ they cried out. ‘What is this?’

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་སྐད་ཅིག་ཅང་མི་སྨྲ་བར་གནས་ཏེ་བསམས་པ།
en: “The bodhisattva remained silent, in thought.

source: བུ་དང་ཆུང་མ་ལ་སོགས་པ་བྱིན་པ་མེད་པས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འཐོབ་པར་མི་འགྱུར་རོ།
en: ‘Unsurpassed and perfect awakening cannot be attained without giving up sons, wife, and so forth,’ he pondered.

source: །དེའི་ཕྱིར་བྲམ་ཟེ་འདི་ལ་དགའ་བས་ཆུང་མ་འདི་སྦྱིན་པར་བྱའོ་སྙམ་དུ་བསམས་ནས་གཉེན་སྡུག་པ་དང་བྲལ་བས་ཞུམ་པའི་སེམས་ཡང་དག་པར་བླངས་ཏེ།
en: ‘Therefore, I must happily give my wife to this brahmin.’ This thought lifted him out of his sadness at losing a loved one.

source: འཕྲལ་དུ་སེང་གེའི་ཁྲི་ལས་བབས་ནས་བྱང་ཆུབ་ཏུ་སྨོན་པའི་སེམས་ཀྱིས་བཙུན་མོ་རྒྱལ་བའི་འོད་ལྷའི་བུ་མོ་བཞིན་དུ་རྣམ་པར་མཛེས་པ།
en: He descended from the lion throne immediately, and keeping in mind the aspirational mind of awakening, he took the goddess-like, intensely beautiful Queen Jayaprabhā with his left hand and held a golden vase in his right.

source: ཁྱོ་དང་བྲལ་བའི་གདུང་བས་ཤིན་ཏུ་དབུགས་རིང་པོ་ཕྱུང་སྟེ།
en: The queen felt great pain at the prospect of being separated from her husband and sighed heavily.

source: མཆི་མས་གང་བའི་མིག་དང་། མུན་པར་གཡང་ས་ཆེན་པོར་ལྷུང་བ་བཞིན་དུ་མཆོག་ཏུ་སྡུག་བསྔལ་བས་གདོང་ཕབ་པ་ལག་པ་གཡོན་པས་བཟུང་སྟེ།
en: Her eyes filled with tears and her face dropped. She suffered as if she had fallen into a deep, dark abyss.

source: ལག་པ་གཡས་པས་གསེར་གྱི་བུམ་པ་ཐོགས་ནས་བྲམ་ཟེའི་ཁྱེའུ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “ ‘Come here, come here great brahmin,’ the king said to the brahmin boy:

source: །བྲམ་ཟེ་ཆེན་པོ་ཚུར་ཤོག །ཚུར་ཤོག །བྲམ་ཟེའི་དམ་པ་གཟུགས་བཟང་བ།
en: “ ‘Handsome, fine brahmin,

source: །སྡུག་པའི་ཆུང་མ་འདི་ལོང་ཤིག །སྦྱིན་པ་འདི་ཡིས་མྱུར་དུ་ནི།
en: You may take my beloved wife. May this act of generosity swiftly bring

source: །བྱང་ཆུབ་དམ་པ་ཐོབ་པར་ཤོག །ཅེས་སྨྲས་ནས་བྱང་ཆུབ་སེམས་དཔས་བྲམ་ཟེ་དེའི་ལག་པར་ཆུའི་རྒྱུན་བླུགས་སོ།
en: The attainment of true awakening.’ “Then, maintaining the mind of awakening, he poured water onto the brahmin’s palm.

source: །དེ་ནས་ཡང་དགེ་སློང་དག་རྒྱལ་པོ་དཔལ་གྱི་སྡེས་ཆུའི་རྒྱུན་བླུགས་པའི་རྗེས་ཐོགས་ཉིད་ལ་དེའི་ཚེ་འཕྲལ་དུ་ས་རྣམ་པ་དྲུག་ཏུ་གཡོས་པར་གྱུར་ཏོ།
en: “Monks, at the very instant that King Śrīsena poured the water, the earth shook in six different ways.

source: །དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་དེས་བྱང་ཆུབ་སེམས་དཔའི་གཏོང་བ་དང་། གཏོང་བ་ལས་ཀྱང་ཤིན་ཏུ་གཏོང་བ། ཤིན་ཏུ་དཀའ་བ་དེ་མཐོང་བ་དང་། མཆོག་ཏུ་ངོ་མཚར་སྐྱེས་སོ།
en: Having witnessed how a bodhisattva gives, a great act of giving, an extremely difficult act of giving, the brahmin boy was utterly seized with wonder.

source: །ནམ་མཁའི་ངོས་ན་གནས་པའི་ལྷ་བརྒྱ་སྟོང་རྣམས་ཀྱིས་ཀྱང་ཅ་ཅོའི་སྒྲ་བཏོན་ཏོ།
en: The act even caused hundreds of thousands of sky-dwelling gods to murmur in amazement.

source: །དེ་མ་ཐག་ཏུ་ཡང་སྐར་མདའ་ལྟུང་བ་དང་། ཕྱོགས་འབར་བ་དང་། བར་སྣང་གི་ལྷ་ཡང་རྔ་རྡུང་བར་གྱུར་ཏོ།
en: Instantly, meteors fell, blazing in all directions, and the celestial gods beat their drums.

source: །དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་དེ་རྒྱལ་པོ་འགྱོད་པར་མ་གྱུར་གྲང་སྙམ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལ་མངོན་པར་བསྟོད་དེ། བདེ་ལེགས་སུ་གྱུར་ཅིག་ཅེས་སྨྲས་ནས་བཙུན་མོ་རྒྱལ་བའི་འོད་ཁྱེར་ཏེ་རིངས་པ་རིངས་པར་བསྟི་གནས་སུ་སོང་སྟེ།
en: “Fearing that the king might change his mind, the brahmin boy praised the bodhisattva, uttered some prayers for his prosperity, and left quickly for home, taking Queen Jayaprabhā with him.

source: མཁན་པོ་ལ་བྱིན་པ་དང་། བཙུན་མོ་རྒྱལ་བའི་འོད་ཉ་ཆུ་ལས་བཏོན་པ་བཞིན་དུ་སྡུག་པ་དང་བྲལ་བའི་སྡུག་བསྔལ་དྲག་པོས་གདུངས་ཤིང་ཉམ་ཐག་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཉིད་ལ་མངོན་པར་སེམས་ཤིང་འགྲོ་བ་ཐམས་ཅད་མུན་པ་མུན་ནག་ཏུ་གྱུར་པ་བཞིན་དུ་ཤེས་ཤིང་ཀྱི་ཧུད་རྒྱལ་པོ་ཆེན་པོ་ཀྱི་ཧུད་རྒྱལ་པོ་ཆེན་པོ་ཞེས་མཆོག་ཏུ་གདུང་བའི་སེམས་དང་ཟས་བཅད་པ་ལ་ཞུགས་སོ།
en: He then gave the queen to his teacher. For Queen Jayaprabhā, being separated from her beloved was like being a fish taken out of water. She was wretched, but she knew that thinking about or following the bodhisattva would be in vain, like wandering from shadows into pitch darkness. Therefore, she merely lamented, ‘Alas, Great King. Alas, Great King.’ Her sadness even caused her to refuse food.

source: །ས་གཡོས་པ་དེས་བརྒྱ་བྱིན་གྱི་གནས་གཡོས་པར་གྱུར་ཏོ།
en: “As the queen suffered, the shaking caused by King Śrīsena’s deed rattled even Śakra’s abode.

source: །ཆོས་ཉིད་ཀྱིས་ལྷ་རྣམས་ཀྱི་ཤེས་པ་འོག་ཏུ་མཐོང་བ་འཇུག་གི་གོང་དུ་ནི་མ་ཡིན་ནོ།
en: The gods spontaneously know what happens below them but not what happens above them.

source: །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བསམས་པ།
en: Śakra, lord of the gods, therefore wondered:

source: ཤིན་ཏུ་གྲགས་པར་ས་གཡོས་པ།
en: “ ‘The earth quakes with a tremendous sound.

source: །མཚན་མ་འདི་ནི་སུའི་མཐུ་ཡིན།
en: Whose power is behind this sign?

source: །གང་གི་མཐུ་ནི་ཅི་འདྲ་བ།
en: What kind of power is it?

source: །ཤིན་ཏུ་གསལ་བར་འདི་ཤེས་བྱ།
en: I must know this very clearly.’

source: །འཛམ་བུའི་གླིང་ཐམས་ཅད་ལ་བལྟ་བར་བརྩམས་པ་དང་། ཇི་ཙམ་ན་བྱང་ཆུབ་སེམས་དཔའ་འདི་ལྟ་བུ་མཆོག་ཏུ་དཀའ་བའི་ལས་བྱེད་པ་མཐོང་ངོ་།
en: “He began to search all over Jambudvīpa. After a while, he discovered that the shaking was a result of the bodhisattva’s extremely difficult act.

source: །མཐོང་ནས་ཀྱང་མཆོག་ཏུ་ངོ་མཚར་སྐྱེས་ཏེ།
en: When he understood this, he was awed.

source: སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་རྣམས་ལ་སྨྲས་པ། གྲོགས་པོ་དག་ཁྱེད་ཅག་རྣམས་རྒྱལ་པོ་དཔལ་གྱི་སྡེའི་ངོ་མཚར་དང་རྨད་དུ་བྱུང་བའི་ལས་ལ་ལྟོས།
en: To the gods of the Heaven of the Thirty-Three, he said, ‘Consider the incredible, amazing act King Śrīsena has performed.

source: གང་ཞིག་འདི་ལྟར་སྡུག་པ་དང་། འདི་ལྟར་ཡིད་དུ་འོང་བ་དང་། འདི་ལྟར་ཕངས་པའི་ཆུང་མ་ལ་མི་སེམས་ཏེ་རྩྭ་བཞིན་དུ་ཡོངས་སུ་གཏོང་ངོ་།
en: Who can give away such a loving, beautiful, and dear wife without any hesitation, as if they were giving away straw?

source: །གྲོགས་པོ་དག་རྣམ་གྲངས་དེས་ཀྱང་འདི་ལྟར་ཤེས་པར་བྱ་སྟེ། བདག་ཉིད་ཆེན་པོ་འདི་རང་གི་ཡན་ལག་དང་ཉིང་ལག་རྣམས་ཀྱང་ཕངས་པ་མེད་པར་གཏོང་བ་ཡིན་ནོ།
en: Friends, through this act we know the great being will give away even his major and minor body parts, without hesitation.’

source: །ལྷ་རྣམས་ཀྱིས་སྨྲས་པ། ཀཽ་ཤི་ཀ་བུ་དང་བུ་མོ་ནི་དེ་བས་ཡོངས་སུ་གཏོང་བར་བྱེད་ཀྱི། འདི་ལྟ་སྟེ།
en: “ ‘Kauśika,’ replied the gods, ‘we believe that he can give away his sons and daughters.

source: ཡན་ལག་དང་ཉིང་ལག་སྟེར་བ་འདི་ནི་དད་པར་བྱ་བ་མ་ཡིན་ཏེ་ཤིན་ཏུ་དཀའོ།
en: But we do not believe he can give away his major and minor body parts. It is too difficult.’

source: །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་སྨྲས་པ།
en: “Śakra, lord of the gods, responded,

source: གྲོགས་པོ་དག་ཞོག་ཞོག །སྤུའི་རྩེ་མོའི་ཆུའི་ཐིགས་པས་རྒྱ་མཚོ་མ་གཞལ་ཅིག །ནམ་མཁའ་འདོམ་གྱིས་མ་གཞལ་ཅིག །ཉི་མ་དང་སྲིན་བུ་མེ་ཁྱེར་འོད་མ་སྙོམ་ཅིག །རིའི་རྒྱལ་པོ་རི་རབ་དང་ཡུངས་འབྲུར་མ་སྙོམ་ཅིག །གཞན་ཡང་ངས་ཁྱེད་ཅག་རྣམས་ཀྱི་མངོན་སུམ་དུ་བྱ་ཡིས།
en: ‘Friends, leave it be, leave it be. Do not measure the ocean against a drop of water so small it rests on the tip of a hair strand. Do not measure space with your arms. Do not compare the light of a firefly to the sun. Do not compare the size of a seed to Mount Sumeru. I will produce evidence for you all.’

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་དེ་ཉིད་ཀྱི་ནམ་ནངས་པ་ན་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་རྣམས་ལ་སྨྲས་པ།
en: “At dawn, Śakra, lord of the gods, spoke again to the gods of the Heaven of the Thirty-Three.

source: ཀྱེ་མའོ་གྲོགས་པོ་དག་ཤེས་པར་གྱིས་ཤིག་ཅེས་སྨྲས་ཏེ། ནང་པར་ཉིད་ལངས་ནས་ལྷའི་བུ་བཞི་དང་ཐབས་ཅིག་ཏུ་སུམ་ཅུ་རྩ་གསུམ་གྱི་གནས་ལས་བབས་ཏེ་གྲོང་ཁྱེར་ཨ་རིཥྛ་དང་ཧ་ཅང་མི་རིང་བའི་ནགས་ཀྱི་ཚང་ཚིང་དུ་ཞུགས་ནས་བྲམ་ཟེ་རྒན་པོའི་ཆ་བྱད་དུ་བྱས་ནས་རང་གི་ལུས་ཀྱི་ལྟེ་བ་མན་ཆད་སོག་ལེས་བཅད་པ་བཞིན་དུ་སྟོན་ཅིང་ཀུན་ནས་ཁྲག་འཛག་པ་ཁྲི་བསྐྱོད་ནས་ལྷའི་བུ་བཞི་བྲམ་ཟེའི་ཆ་བྱད་འཛིན་པས་ཕ་དང་བྲལ་བའི་སྡུག་བསྔལ་གྱིས་ཉམ་ཐག་པ་ལྟར་ཉམ་ཐག་པའི་ང་རོས་ཆོ་ངེས་འདེབས་ཤིང་བཏེག་པར་མངོན་པར་སྤྲུལ་ཏེ།
en: ‘Look, friends! Now you shall understand!’ That morning, he and four other gods from the Heaven of the Thirty-Three descended to earth, alighting in a forest near Ariṣṭa city. Śakra transformed himself into an old brahmin whose body had been hacked away below the navel, as if by a saw. Blood gushed from all sides of the wound. The other four gods of the Heaven of the Thirty-Three emanated as this old brahmin’s sons. They lifted him onto a stretcher while wailing wretchedly at the agony of losing their father.

source: ངའི་ལུས་འདིའི་ཕྱེད་སྟག་གིས་བཅད་དེ་ཟོས་སོ་ཞེས་འདི་ལྟར་བསྟན་པར་བྱའོ་སྙམ་ནས་ཡིད་ལ་བསམས་པ་བཞིན་དུ། ཉི་མ་ཤར་བའི་དུས་སུ་ནགས་ཚང་ཚིང་དེ་ནས་བྱུང་སྟེ།
en: They left the forest at sunrise, traveling toward the city, intending to claim that the old brahmin’s lower body had been eaten by a tiger.

source: གྲོང་ཁྱེར་དུ་མངོན་པར་ཕྱོགས་ནས་ཀུན་དུ་ཆས་སོ།
en: They arrived at the city gate quickly.

source: །ཁྲག་གི་དྲི་དེ་ལ་ཡང་སྟེང་ནས་ཁྭ་དང་ཆུ་སྐྱར་དང་། བྱ་རྒོད་རྣམས་རྗེས་སུ་འབྲང་ངོ་།
en: Hawks, gulls, and vultures hovered in the sky above them, drawn by the smell of the old brahmin’s blood.

source: །འོག་ནས་ཀྱང་ཁྱི་དང་ཝ་རྣམས་རྗེས་སུ་འབྲང་བཞིན་དུ་རིངས་པ་རིངས་པར་གྲོང་ཁྱེར་གྱི་སྒོར་སོང་ངོ་།
en: Dogs and foxes trailed behind them on the ground.

source: །དེ་ཡང་འདི་ལྟར་སྙིང་རྗེའི་གནས་སུ་གྱུར་པ།
en: “The old brahmin looked pitiful.

source: སྐྱེས་པ་དང་བུད་མེད་རྣམས་ཀྱིས་མཐོང་ནས་སྙིང་རྗེས་གདུངས་པའི་ཡིད་ཀྱིས་གཅིག་ལ་གཅིག་སྨྲ་བ།
en: His plight moved the men and women who saw him. Some asked each other,

source: གྲོགས་དག་བྲམ་ཟེ་འདི་རྐེད་པར་ཆད་ནས་འདིའི་དབང་པོ་ཡང་མ་འཁྲུགས་པ་ཇི་ལྟར་འཚོ་བར་འགྱུར།
en: ‘Friends, how is the old brahmin still alive when he has no lower body? How are his organs intact?’

source: གཞན་ཞིག་གིས་སྨྲས་པ། འདི་མི་མ་ཡིན་གྱི་ཤ་ཟ་མིའི་ཆ་བྱད་ཀྱིས་བདག་ཅག་བཟའ་བའི་ཕྱིར་འདིར་འོངས་ཀྱི།
en: Others speculated, ‘He must be a nonhuman demon who has come to devour us.

source: མི་རྐེད་པར་ཆད་པ་ནི་འཚོ་བ་མེད་དོ། །དེ་སྐད་ཅེས་ཐོས་པ་དང་སྐྱེས་བུ་སྡར་མ་ནི་འཇིགས་པས་བྲོས་པར་བརྩམས་སོ།
en: How else would someone survive without his lower body?’ When the fainthearted heard this, they ran away out of fear.

source: །སྐྱེས་བུ་དཔའ་བོ་གཞན་ཞིག་འདི་སྙམ་དུ་འདི་ནི་ཤ་ཟ་ཞིག་སྟེ།
en: But one brave man thought, ‘He must be a demon.

source: དེ་ལྟ་ན་ཡང་ཚོར་བས་ཉེན་བཞིན་དུ་འདི་ལྟར་དབང་པོ་རྣམས་བདེ་བར་སྣང་ན་དེ་ཇི་ལྟ་བུ་ཡིན།
en: If he isn’t a demon, how could he appear to have his faculties despite his imperiled state?

source: བདག་གིས་འདི་ལ་མི་མ་ཡིན་ནམ་ཤ་ཟར་གྱུར་པ་ཡིན་པར་དྲི་བར་བྱས་ན་འདིས་ཚིག་ཐོན་པར་དཀའ་མོད་ཀྱི། གལ་ཏེ་ཚིག་ཐོན་ན་ནི་ངོ་མཚར་དུ་འགྱུར་རོ། །
en: I will ask him if he is a nonhuman or a demon. It will be difficult for him to speak, but if he does, that would be astonishing.’

source: ཇི་ཙམ་ན་གཞན་ཞིག་ལྟད་མོ་སྐྱེས་ནས་སྨྲས་པ།
en: A while later, one of the others who saw the spectacle asked,

source: བྲམ་ཟེ་ཁྱོད་ཅི་མི་ཡིན་ནམ།
en: ‘Brahmin! Are you a human or a demon?

source: འོན་ཏེ་ཤ་ཟ་ཡིན་ཁྱོད་ཀྱི་ལུས་འདི་རྐེད་པར་སུས་བཅད་ནས་གནས་སྐབས་འདི་ལྟ་བུར་བྱས།
en: Who cut off the lower half of your body and left you in this state?

source: ཁྱོད་ནི་ག་ལས་འོངས།
en: Where did you come from?’

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བདག་ཉིད་འདི་ལྟར་ཁྲིའི་སྟེང་དུ་འདུག་ཅིང་སྡུག་བསྔལ་དྲག་པོའི་ཚོར་བས་ཉེན་པ་བཞིན་དུ་ཉེ་བར་སྟོན་ཅིང་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ།
en: “Then Śakra, lord of the gods, in the form of the old brahmin, lying on the stretcher and acting as if he were in tremendous pain, replied in verse:

source: །ཤི་བི་པ་ཁྱེད་མ་འཇིགས་ཤིག །བྲམ་ཟེ་ང་ཡིན་སྲིན་པོ་མིན།
en: “ ‘Man of Śibi, be not afraid. I am a brahmin, not a demon.

source: །སྔོན་གྱི་ལས་ཀྱི་ཉེས་པ་ཡིས།
en: Because of past deeds,

source: །གནས་སྐབས་འདི་འདྲ་ཐོབ་པར་གྱུར།
en: I have ended up in this state.

source: །འདི་ཉིད་དུ་ནི་ཀུན་བཤད་ན།
en: “ ‘Were I to explain everything,

source: །དུས་ནི་ཀུན་དུ་འདའ་བར་འགྱུར།
en: My time would run out.

source: །འཆི་བདག་མྱུར་དུ་འོངས་ནས་ནི།
en: The Lord of Death is coming quickly.

source: །སྲོག་ནི་འཕྲོག་པར་འགྱུར་དུ་འོང་།
en: He will snatch my life away.

source: །ཆོས་ཀྱི་རྒྱལ་པོའི་སྤྱན་སྔར་ནི།
en: “ ‘Please report all this To your Dharma king.

source: །འདི་དག་ཀུན་ཀྱང་བཤད་པར་བྱ།
en: It is certain that I must experience

source: །སྔོན་གྱི་ལས་ཀྱི་མཚན་ཉིད་ནི། །དེ་རིང་ང་ལ་འབྲས་བཅས་གྱུར།
en: The fruits of past actions today. “ ‘Where can I gaze upon the great one?

source: །ཡོན་ཏན་ཀུན་གྱིས་རྣམ་མཛེས་ལ།
en: Where is the one adorned with all good qualities,

source: །ཟླ་བ་ལྟ་བུར་ཞི་བ་དང་། །སྦྱིན་དང་ཚུལ་ཁྲིམས་ལ་དགའ་བའི།
en: The one who is as peaceful as the moon, The one who loves giving and discipline?

source: །གཙོ་བོ་གང་དུ་མཐོང་བར་འགྱུར།
en: “ ‘Where does the Dharma king live?

source: །རྒྱ་མཚོ་བཞིན་དུ་ཟབ་གྱུར་ཅིང་།
en: Where lives the one who is as deep as the ocean,

source: །རི་རབ་ལྟ་བུར་མི་གཡོ་བ།
en: The one who is as stable as Mount Sumeru,

source: །འཇིག་རྟེན་ཀུན་གྱི་གཙོར་གྱུར་པ། །ཆོས་ཀྱི་རྒྱལ་པོ་གང་ན་བཞུགས།
en: He who is chief among all beings?
